Table of Contents
 Class Vector3D
Namespace
IdeaRS.OpenModel.Geometry3D
Assembly
IdeaRS.OpenModel.dll
Represents a vector in three-dimensional space.
[OpenModelClass("CI.Geometry3D.Vector3D,CI.BasicTypes")]
[DataContract]
public class Vector3D : OpenObject
Inheritance
object
OpenObject
Vector3D
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 X
Gets or sets the X-dirrection value
[OpenModelProperty("DirectionX")]
[DataMember]
public double X { get; set; }
Property Value
double
 Y
Gets or sets the Y-dirrection value
[OpenModelProperty("DirectionY")]
[DataMember]
public double Y { get; set; }
Property Value
double
 Z
Gets or sets the Z-dirrection value
[OpenModelProperty("DirectionZ")]
[DataMember]
public double Z { get; set; }
Property Value
double
 Edit this page